Autodesk.Revit.DB.SpecUtils.IsValidDataType(Autodesk.Revit.DB.ForgeTypeId)
Returns true if the given ForgeTypeId identifies a valid parameter data type.
Remarks:
A ForgeTypeId is acceptable as a parameter data type if it
identifies either a spec or a category. When a category
identifier is used as a parameter data type, it indicates a
Family Type parameter of that category.
dataType:
The identifier to check.
Returns:
True if the ForgeTypeId identifies either a spec or a category, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SpecUtils.GetAllSpecs
Gets the identifiers of all specs.
Returns:
The spec identifiers.
Since:
2022

Autodesk.Revit.DB.SpecUtils.IsSpec(Autodesk.Revit.DB.ForgeTypeId)
Checks whether a ForgeTypeId identifies a spec.
specTypeId:
The identifier to check.
Returns:
True if the ForgeTypeId identifies a spec, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.SpecUtils
A utility class of functions related to specs. A spec describes a data type that parameters can hold.
Since:
2022